classes/B2B_VertexTaxCalculationCalloutMock.cls

/****************************************************************************************************************
Name: 			B2B_VertexTaxCalculationCalloutMock
Purpose: 		This class is to provide Tax from Vertex API.
Date: 			28/01/2021
Created By: 	Radhey Shyam Gupta
******************************************************************************************************************
MODIFICATIONS – 	Date 		|	Dev Name		|	Method		|	User Story
******************************************************************************************************************
22/05/2022	|	Soumya Sahoo	|				    |	Error handling changes- JIRA- 8617
******************************************************************************************************************/
@isTest
global class B2B_VertexTaxCalculationCalloutMock implements HttpCalloutMock {
	 global HTTPResponse respond(HTTPRequest request) {
        // Create a fake response
        HttpResponse response = new HttpResponse();
        response.setHeader('Content-Type', 'text/xml');
        String reqBody = request.getBody();
         //negative response 
         if(reqBody.contains('QuotationRequest')){
             String body = '<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><VertexEnvelope xmlns="urn:vertexinc:o-series:tps:9:0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><Login><TrustedId>******</TrustedId></Login><QuotationResponse documentDate="2021-02-19" transactionType="SALE" postingDate="2021-02-19"><Seller><Company>AHM Group</Company><Division>206500</Division></Seller><SubTotal>100.0</SubTotal><Total>108.25</Total><TotalTax>8.25</TotalTax><LineItem lineItemNumber="1"><Seller><AdministrativeOrigin taxAreaId="443810070"><StreetAddress1>4300 S Georgia St</StreetAddress1><City>AMARILLO</City><MainDivision>TX</MainDivision><PostalCode>79110-1722</PostalCode></AdministrativeOrigin></Seller><Customer><Destination taxAreaId="441130760"><StreetAddress1>1234 Main Street</StreetAddress1><City>DALLAS</City><MainDivision>TX</MainDivision><PostalCode>75201</PostalCode></Destination></Customer>';
             body += '<Product>00004</Product><Quantity>1.0</Quantity><FairMarketValue>-100.0</FairMarketValue><ExtendedPrice>-100.0</ExtendedPrice><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="STATE" jurisdictionId="35763">TEXAS</Jurisdiction><CalculatedTax>-6.25</CalculatedTax><EffectiveRate>0.0625</EffectiveRate><Taxable>-100.0</Taxable><Imposition impositionId="1">Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType><TaxRuleId>18653</TaxRuleId><NominalRate>0.0625</NominalRate></Taxes><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="CITY" jurisdictionId="77868">DALLAS</Jurisdiction><CalculatedTax>-1.0</CalculatedTax><EffectiveRate>0.01</EffectiveRate><Taxable>-100.0</Taxable><Imposition impositionId="1">Local Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType><TaxRuleId>26262</TaxRuleId><NominalRate>0.01</NominalRate></Taxes><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="TRANSIT_DISTRICT" jurisdictionId="78120"><![CDATA[DALLAS METROPOLITAN TRANSIT AUTHORITY]]></Jurisdiction><CalculatedTax>-1.0</CalculatedTax>';
             body += '<EffectiveRate>0.01</EffectiveRate><Taxable>-100.0</Taxable><Imposition impositionId="1">Local Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType><TaxRuleId>26649</TaxRuleId><NominalRate>0.01</NominalRate></Taxes><TotalTax>-8.25</TotalTax><FlexibleFields><FlexibleNumericField fieldId="2">3500</FlexibleNumericField></FlexibleFields><AssistedParameters><AssistedParameter paramName="FLEX.input.GVW" phase="PRE" ruleName="Set Vehicle Weight" originalValue="">3500</AssistedParameter></AssistedParameters></LineItem><LineItem lineItemNumber="2"><Seller><AdministrativeOrigin taxAreaId="443810070"><StreetAddress1>4300 S Georgia St</StreetAddress1><City>AMARILLO</City><MainDivision>TX</MainDivision><PostalCode>79110-1722</PostalCode></AdministrativeOrigin></Seller><Customer><Destination taxAreaId="441130760"><StreetAddress1>1234 Main St</StreetAddress1><City>DALLAS</City><MainDivision>TX</MainDivision><PostalCode>75201</PostalCode></Destination></Customer><Quantity>1.0</Quantity><FairMarketValue>200.0</FairMarketValue><ExtendedPrice>200.0</ExtendedPrice><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="STATE" jurisdictionId="35763">TEXAS</Jurisdiction>';
             body += '<CalculatedTax>12.5</CalculatedTax><EffectiveRate>0.0625</EffectiveRate><Taxable>200.0</Taxable><Imposition impositionId="1">Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType><TaxRuleId>18653</TaxRuleId><NominalRate>0.0625</NominalRate></Taxes><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="CITY" jurisdictionId="77868">DALLAS</Jurisdiction><CalculatedTax>2.0</CalculatedTax><EffectiveRate>0.01</EffectiveRate><Taxable>200.0</Taxable><Imposition impositionId="1">Local Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType><TaxRuleId>26262</TaxRuleId><NominalRate>0.01</NominalRate></Taxes><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="TRANSIT_DISTRICT" jurisdictionId="78120"><![CDATA[DALLAS METROPOLITAN TRANSIT AUTHORITY]]></Jurisdiction><CalculatedTax>2.0</CalculatedTax><EffectiveRate>0.01</EffectiveRate><Taxable>200.0</Taxable><Imposition impositionId="1">Local Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>';
             body += '<TaxRuleId>26649</TaxRuleId><NominalRate>0.01</NominalRate></Taxes><TotalTax>16.5</TotalTax><FlexibleFields><FlexibleNumericField fieldId="2">3500</FlexibleNumericField></FlexibleFields><AssistedParameters><AssistedParameter paramName="FLEX.input.GVW" phase="PRE" ruleName="Set Vehicle Weight" originalValue="">3500</AssistedParameter></AssistedParameters></LineItem></QuotationResponse><ApplicationData><ResponseTimeMS>122.9</ResponseTimeMS></ApplicationData></VertexEnvelope></soapenv:Body></soapenv:Envelope>';        
             response.setBody(body); 
         }
            response.setStatusCode(200);
            return response; 
    }
}